IDEA Connection Link
Log4NetHelper Class
 Log4NetHelper
Inheritance Hierarchy
System.Object
 IdeaRS.ConnectionLink.Log4NetHelper
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class Log4NetHelper
Public Class Log4NetHelper
public ref class Log4NetHelper
The Log4NetHelper type exposes the following members.
Constructors
Name | Description
Log4NetHelper
Initializes a new instance of the Log4NetHelper class
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Initialize
 Initialize
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.ConnectionLink Namespace